const MerchantDetailButton = () => {
  return (
    <button className="flex items-center gap-0.5 text-xs font-medium text-left text-[#1a7cfd]">
      <svg
        width={16}
        height={16}
        viewBox="0 0 16 16"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
        className="flex-grow-0 flex-shrink-0 w-4 h-4 relative"
        preserveAspectRatio="none"
      >
        <path
          fillRule="evenodd"
          clipRule="evenodd"
          d="M8 2.66665C10.9333 2.66665 13.3333 5.06665 13.3333 7.99998C13.3333 10.9333 10.9333 13.3333 8 13.3333C5.06666 13.3333 2.66666 10.9333 2.66666 7.99998C2.66666 5.06665 5.06666 2.66665 8 2.66665ZM8 14.6666C11.6667 14.6666 14.6667 11.6666 14.6667 7.99998C14.6667 4.33331 11.6667 1.33331 8 1.33331C4.33333 1.33331 1.33333 4.33331 1.33333 7.99998C1.33333 11.6666 4.33333 14.6666 8 14.6666ZM8.66666 7.66665C8.66666 7.26665 8.4 6.99998 8 6.99998C7.6 6.99998 7.33333 7.26665 7.33333 7.66665V11C7.33333 11.4 7.6 11.6666 8 11.6666C8.4 11.6666 8.66666 11.4 8.66666 11V7.66665ZM8.79999 5.33331C8.79999 4.86665 8.4 4.53331 8 4.53331C7.53333 4.53331 7.2 4.93331 7.2 5.33331C7.2 5.79998 7.6 6.13331 8 6.13331C8.46666 6.13331 8.79999 5.79998 8.79999 5.33331Z"
          fill="#1A7CFD"
        />
      </svg>
      사업장 정보
    </button>
  );
};

export default MerchantDetailButton;
